_site/org/2014-1-14-yasnippet.org
#+STARTUP:showall

#+TITLE:Emacs-Yasnippet代码模板
#+DATE:<2014-01-14 周二>
#+AUTHOR:Sylvan.Li
#+EMAIL:sylvan9527@gmail.com
#+STYLE:<link rel="stylesheet" href="../stylesheets/worg.css" type="text/css" />

#+BEGIN_HTML
---
layout: default
title: Emacs-Yasnippet代码模板
---
#+END_HTML

YASnippet 是 Emacs 的一个缩略词 (abbreviation) 模板替换系统，可以把一
个预先设定好的缩略词扩展成模板。简单来讲，你可以将一些常用的代码或者文
字记录下来通过设定“代码片段名”来快速插入。


* YASnippet 安装

* YASnippet 使用

  在 Emacs 启动后，YASnippet 模式是作为一个子模式 (minor mode) 存在于
  各个模式之中。要用 YASnippet 进行缩略词补全有好多种方法，最常用的补
  全方法有三种：

  - 输入一个缩写词 (abbrev)，然后用 snippet 的触发键 (trigger key) 来
    补全。这个键默认是 TAB 或是 C-i，当然，也可以用命令 M-x yas/expand
    来进行扩展。

  - 用命令 M-x yas/insert-snippet 直接进行输入，输入完这个命令后，会弹
    出一个补全窗口，提示当前主模式下可以补全的模板。

  - 直接从菜单栏里的 YASnippet 里，选择内容进行输入。

    关于安装好YASnippet自带很多代码模板，可以通过菜单栏查看，也可以到
    YASnippet的安装目录下去查看，我的为.emacs.d\snippets\text-mode(通
    过elpa安装)

* 定制自己的模板

  切换到需要创建模板的模式下，输入命令 M-x yas/new-snippet 就可以新
  建一个扩展模板 (snippet)，YASnippet 会自动提示存放该模板的最佳目录。
  输入完命令会看到如下信息:

#+BEGIN_EXAMPLE

 # -*- mode: snippet -*-    
 # name: Copyright   
 # key:    
 # binding: "keybinding"    
 # expand-env: ((some-var some-value))   
 # --  

#+END_EXAMPLE

 
   -    #name: 显示在弹出菜单里的 snippet 名称
   -    #key: 缩略词，即你在用 TAB 键进行扩展前输入的关键词，如果不设定，则把这个关键词默认为本文件名
   -    #binding: 设置使用哪个组合键来直接插入这个 snippet，对于比较常用的模板内容比较有用
   -    #expand-env: 用 elisp 重新设置一些环境变量
   -    #– 表示在这一行之上的全是注释 

   这里对于除了name之外的高级配置暂时忽略，想得到详细信息的话可以去看
   官方文档。name即为你要输入代码缩写。

#+BEGIN_QUOTE

   如果YASnippet guess不到自动保存模板的目录，则需要自己存放在
   YASnippet安装目录的相应模式下面，看到你就懂了，至于怎么自定义save和
   load路径，这里不做研究了。

#+END_QUOTE
