_posts/2014-1-14-yasnippet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs-Yasnippet代码模板</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Emacs-Yasnippet代码模板"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-14"/>
<meta name="author" content="Sylvan.Li"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="../stylesheets/worg.css" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Emacs-Yasnippet代码模板</h1>




---
layout: default
title: Emacs-Yasnippet代码模板
---

<p>
YASnippet 是 Emacs 的一个缩略词 (abbreviation) 模板替换系统，可以把一
个预先设定好的缩略词扩展成模板。简单来讲，你可以将一些常用的代码或者文
字记录下来通过设定“代码片段名”来快速插入。
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 YASnippet 安装</a></li>
<li><a href="#sec-2">2 YASnippet 使用</a></li>
<li><a href="#sec-3">3 定制自己的模板</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> YASnippet 安装</h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> YASnippet 使用</h2>
<div class="outline-text-2" id="text-2">


<p>
  在 Emacs 启动后，YASnippet 模式是作为一个子模式 (minor mode) 存在于
  各个模式之中。要用 YASnippet 进行缩略词补全有好多种方法，最常用的补
  全方法有三种：
</p>
<ul>
<li>输入一个缩写词 (abbrev)，然后用 snippet 的触发键 (trigger key) 来
    补全。这个键默认是 TAB 或是 C-i，当然，也可以用命令 M-x yas/expand
    来进行扩展。

</li>
<li>用命令 M-x yas/insert-snippet 直接进行输入，输入完这个命令后，会弹
    出一个补全窗口，提示当前主模式下可以补全的模板。

</li>
<li>直接从菜单栏里的 YASnippet 里，选择内容进行输入。

<p>
    关于安装好YASnippet自带很多代码模板，可以通过菜单栏查看，也可以到
    YASnippet的安装目录下去查看，我的为.emacs.d\snippets\text-mode(通
    过elpa安装)
</p></li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 定制自己的模板</h2>
<div class="outline-text-2" id="text-3">


<p>
  切换到需要创建模板的模式下，输入命令 M-x yas/new-snippet 就可以新
  建一个扩展模板 (snippet)，YASnippet 会自动提示存放该模板的最佳目录。
  输入完命令会看到如下信息:
</p>



<pre class="example">
# -*- mode: snippet -*-    
# name: Copyright   
# key:    
# binding: "keybinding"    
# expand-env: ((some-var some-value))   
# --  

</pre>



<ul>
<li>#name: 显示在弹出菜单里的 snippet 名称
</li>
<li>#key: 缩略词，即你在用 TAB 键进行扩展前输入的关键词，如果不设定，则把这个关键词默认为本文件名
</li>
<li>#binding: 设置使用哪个组合键来直接插入这个 snippet，对于比较常用的模板内容比较有用
</li>
<li>#expand-env: 用 elisp 重新设置一些环境变量
</li>
<li>#– 表示在这一行之上的全是注释 
</li>
</ul>


<p>
   这里对于除了name之外的高级配置暂时忽略，想得到详细信息的话可以去看
   官方文档。name即为你要输入代码缩写。
</p>
<blockquote>


<p>
如果YASnippet guess不到自动保存模板的目录，则需要自己存放在
YASnippet安装目录的相应模式下面，看到你就懂了，至于怎么自定义save和
load路径，这里不做研究了。
</p>

</blockquote>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-14</p>
<p class="author">Author: Sylvan.Li</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
